In [1]:
import pandas as pd

In [2]:
student_marks1=pd.DataFrame({"Name":["Alex","Mark","Zack"],"Score":[88,67,89],"Subject":["python","java","c++"]},index=[0,1,2])

In [3]:
student_marks1

   Name  Score Subject
0  Alex     88  python
1  Mark     67    java
2  Zack     89     c++

In [4]:
student_marks2=pd.DataFrame({"Name":["Marten","Rojer","Kelly"],"Score":[76,87,76],"Subject":["python","java","dot net"]},index=[0,1,2])

In [5]:
student_marks2

     Name  Score  Subject
0  Marten     76   python
1   Rojer     87     java
2   Kelly     76  dot net

In [6]:
df=pd.concat([student_marks1,student_marks2]) # Default index also added

In [7]:
df

     Name  Score  Subject
0    Alex     88   python
1    Mark     67     java
2    Zack     89      c++
0  Marten     76   python
1   Rojer     87     java
2   Kelly     76  dot net

In [8]:
df2=pd.concat([student_marks1,student_marks2],ignore_index=True)

In [9]:
df2

     Name  Score  Subject
0    Alex     88   python
1    Mark     67     java
2    Zack     89      c++
3  Marten     76   python
4   Rojer     87     java
5   Kelly     76  dot net

In [10]:
df3=pd.concat([student_marks1,student_marks2],ignore_index=True,keys=["BatchA","BatchB"])

In [11]:
df3

     Name  Score  Subject
0    Alex     88   python
1    Mark     67     java
2    Zack     89      c++
3  Marten     76   python
4   Rojer     87     java
5   Kelly     76  dot net

In [13]:
df3=pd.concat([student_marks1,student_marks2],keys=["BatchA","BatchB"])

In [14]:
df3

            Name  Score  Subject
BatchA 0    Alex     88   python
       1    Mark     67     java
       2    Zack     89      c++
BatchB 0  Marten     76   python
       1   Rojer     87     java
       2   Kelly     76  dot net

In [15]:
df3.loc["BatchA"]

   Name  Score Subject
0  Alex     88  python
1  Mark     67    java
2  Zack     89     c++

In [16]:
df3.loc["BatchB"]

     Name  Score  Subject
0  Marten     76   python
1   Rojer     87     java
2   Kelly     76  dot net

In [17]:
pd.concat([student_marks1,student_marks2],axis=1)

   Name  Score Subject    Name  Score  Subject
0  Alex     88  python  Marten     76   python
1  Mark     67    java   Rojer     87     java
2  Zack     89     c++   Kelly     76  dot net